import { Component } from '@angular/core';
import { AboutInfo } from '../../models/misc/about-info';

@Component({
  selector: 'app-about',
  templateUrl: './about.component.html',
  styleUrls: ['./about.component.css']
})
export class AboutComponent {
  selectedIndex: number = 0;
  aboutInfos: AboutInfo[] = [
    {
      heading: 'За приложението',
      text: 'Оптима ресторанти е онлайн приложение, целящо да улесни работата на сервитьори и ресторантьори, като им предостави сигурна онлайн среда за наблюдаване, оптимизиране и дигитализиране на работния процес, чрез даване иполучаване на оценки, организиране на графици, генериране на резюмета (CV) и други.'
    },
    {
      heading: 'За работниците (сервитьорите)',
      text: 'Пред сервитьорите регистрирани в системата ще се отворят множество възможности. На всеки от тях ще бъде предоставен QR код, чрез който те ще могат да бъдат оценявани от клиентите им. Ще могат да свалят автоматично генерирани резюмета, съдържащи личната им информация, предишния им работен опит и настоящето им работно място. Приложението ще им асистира в организирането им на графици и дори позволява работа на няколко различни места едновременно. Чрез него, те ще имат и възможност да кандидатстват за работа.'
    },
    {
      heading: 'За управителите',
      text: 'Управителите на ресторантите са нашият най-ценен потребител и съответно тези, които получават най-много от използването на ОптимаРесторанти. Те могат да регистрират своите ресторанти, да наемат работници в тях, да организират графиците им и да следят качеството на работата на служителите си изцяло онлайн, давайки им възможност за оптимизация и дигитализация на работния процес.'
    },
    {
      heading: 'За клиента',
      text: 'За обикновенния потребител Оптима Ресторанти предлага надежна и сигурна система за откриване на най-добрите ресторанти в района, както и средство за изразяване на мнение спрямо ресторант и обслужващ персонал.'
    },
    {
      heading: 'За нас',
      text: ''
    }];

    public switchAboutInfo(index: number) {
      this.selectedIndex = index;
    }
}
